uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_i2s.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/spinlock.h>
#include <nuttx/queue.h>
#include <nuttx/wqueue.h>
#include <nuttx/audio/audio.h>
#include <nuttx/audio/i2s.h>

#include "riscv_internal.h"
#include "esp_cache.h"
#include "esp_gpio_p4.h"
#include "esp_irq_p4.h"
#include "esp32p4_i2s.h"

#include "soc/interrupts.h"
#include "soc/hp_sys_clkrst_struct.h"
#include "soc/lp_clkrst_struct.h"
#include "soc/ahb_dma_struct.h"
#include "soc/ahb_dma_reg.h"
#include "soc/gpio_sig_map.h"
#include "hal/i2s_ll.h"
#include "hal/i2s_hal.h"
#include "hal/ahb_dma_ll.h"
#include "hal/gdma_ll.h"
#include "hal/dma_types.h"
#include "hal/i2s_periph.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_ESP32P4_I2S_MAXINFLIGHT
#  define CONFIG_ESP32P4_I2S_MAXINFLIGHT 4
#endif

#define I2S_SRC_CLK_FREQ 160000000UL /* PLL_160M clock source */

#define I2S_ALIGN_UP(num, align) (((num) + ((align) - 1)) & ~((align) - 1))
#define I2S_DMA_MAX_BYTES 4092
#define I2S_DMA_CACHE_ALIGN 64

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Audio buffer tracking container */

struct esp32p4_i2s_buf_s
{
  struct esp32p4_i2s_buf_s *flink;
  dma_descriptor_t dma_desc __attribute__((aligned(I2S_DMA_CACHE_ALIGN)));
  uint8_t desc_padding[I2S_DMA_CACHE_ALIGN - sizeof(dma_descriptor_t)];
  i2s_callback_t callback;
  FAR void *arg;
  FAR struct ap_buffer_s *apb;
  int result;
};

/* Stream state for TX or RX */

struct esp32p4_i2s_stream_s
{
  sq_queue_t pend;
  sq_queue_t act;
  sq_queue_t done;
  struct work_s work;
  int cpuint;
  bool running;
};

/* I2S controller private structure */

struct esp32p4_i2s_priv_s
{
  struct i2s_dev_s dev;
  int port;
  int dma_channel;
  mutex_t lock;
  spinlock_t slock;
  uint32_t rate;
  uint32_t mclk;
  uint8_t data_width;
  uint8_t channels;
  struct esp32p4_i2s_stream_s tx;
  struct esp32p4_i2s_stream_s rx;
  struct esp32p4_i2s_buf_s tx_bufs[CONFIG_ESP32P4_I2S_MAXINFLIGHT];
  struct esp32p4_i2s_buf_s rx_bufs[CONFIG_ESP32P4_I2S_MAXINFLIGHT];
  uint8_t rx_data[CONFIG_ESP32P4_I2S_MAXINFLIGHT][4096]
    __attribute__((aligned(I2S_DMA_CACHE_ALIGN)));
  sq_queue_t tx_free;
  sq_queue_t rx_free;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_I2S0_TX
static int      i2s_txchannels(FAR struct i2s_dev_s *dev, uint8_t channels);
static uint32_t i2s_txsamplerate(FAR struct i2s_dev_s *dev, uint32_t rate);
static uint32_t i2s_txdatawidth(FAR struct i2s_dev_s *dev, int bits);
static int      i2s_send(FAR struct i2s_dev_s *dev,
                         FAR struct ap_buffer_s *apb,
                         i2s_callback_t callback, FAR void *arg,
                         uint32_t timeout);
static int      i2s_tx_interrupt(int irq, FAR void *context, FAR void *arg);
static void     i2s_tx_worker(FAR void *arg);
#endif

#ifdef CONFIG_ESP32P4_I2S0_RX
static int      i2s_rxchannels(FAR struct i2s_dev_s *dev, uint8_t channels);
static uint32_t i2s_rxsamplerate(FAR struct i2s_dev_s *dev, uint32_t rate);
static uint32_t i2s_rxdatawidth(FAR struct i2s_dev_s *dev, int bits);
static int      i2s_receive(FAR struct i2s_dev_s *dev,
                            FAR struct ap_buffer_s *apb,
                            i2s_callback_t callback, FAR void *arg,
                            uint32_t timeout);
static int      i2s_rx_interrupt(int irq, FAR void *context, FAR void *arg);
static void     i2s_rx_worker(FAR void *arg);
#endif

static int      i2s_ioctl(FAR struct i2s_dev_s *dev, int cmd,
                          unsigned long arg);
static uint32_t i2s_getmclkfrequency(FAR struct i2s_dev_s *dev);
static uint32_t i2s_setmclkfrequency(FAR struct i2s_dev_s *dev,
                                     uint32_t frequency);
static void     i2s_set_clock(FAR struct esp32p4_i2s_priv_s *priv);
static void     i2s_hw_init(FAR struct esp32p4_i2s_priv_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct i2s_ops_s g_i2sops =
{
#ifdef CONFIG_ESP32P4_I2S0_TX
  .i2s_txchannels        = i2s_txchannels,
  .i2s_txsamplerate      = i2s_txsamplerate,
  .i2s_txdatawidth       = i2s_txdatawidth,
  .i2s_send              = i2s_send,
#endif
#ifdef CONFIG_ESP32P4_I2S0_RX
  .i2s_rxchannels        = i2s_rxchannels,
  .i2s_rxsamplerate      = i2s_rxsamplerate,
  .i2s_rxdatawidth       = i2s_rxdatawidth,
  .i2s_receive           = i2s_receive,
#endif
  .i2s_ioctl             = i2s_ioctl,
  .i2s_getmclkfrequency  = i2s_getmclkfrequency,
  .i2s_setmclkfrequency  = i2s_setmclkfrequency,
};

