uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
static struct esp32p4_i2s_priv_s g_i2s0_priv =
{
  .dev.ops     = &g_i2sops,
  .port        = 0,
  .dma_channel = 0,
  .lock        = NXMUTEX_INITIALIZER,
  .slock       = SP_UNLOCKED,
  .rate        = CONFIG_ESP32P4_I2S0_SAMPLE_RATE,
  .mclk        = CONFIG_ESP32P4_I2S0_SAMPLE_RATE * 256,
  .data_width  = CONFIG_ESP32P4_I2S0_DATA_BIT_WIDTH,
  .channels    = 2,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: i2s_set_clock
 *
 * Description:
 *   Calculate and apply MCLK and BCLK dividers for the given sample rate.
 ****************************************************************************/

static void i2s_set_clock(FAR struct esp32p4_i2s_priv_s *priv)
{
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);
  hal_utils_clk_div_t mclk_div;
  uint32_t bclk_div;
  uint32_t bclk;

  if (priv->rate == 0)
    {
      return;
    }

  if (priv->mclk == 0)
    {
      priv->mclk = priv->rate * 256;
    }

  i2s_hal_calc_mclk_precise_division(I2S_SRC_CLK_FREQ,
                                     priv->mclk, &mclk_div);

  /* BCLK = rate * channels * slot_bits (32 bits slot) */

  bclk = priv->rate * priv->channels * 32;
  bclk_div = (bclk > 0) ? (priv->mclk / bclk) : 8;
  if (bclk_div == 0)
    {
      bclk_div = 1;
    }

#ifdef CONFIG_ESP32P4_I2S0_TX
  HP_SYS_CLKRST.peri_clk_ctrl13.reg_i2s0_tx_clk_en = 1;
  _i2s_ll_tx_clk_set_src(hw, I2S_CLK_SRC_PLL_160M);
  _i2s_ll_tx_set_mclk(hw, &mclk_div);
  i2s_ll_tx_set_bck_div_num(hw, bclk_div);
  i2s_ll_tx_update(hw);
#endif

#ifdef CONFIG_ESP32P4_I2S0_RX
  HP_SYS_CLKRST.peri_clk_ctrl11.reg_i2s0_rx_clk_en = 1;
  _i2s_ll_rx_clk_set_src(hw, I2S_CLK_SRC_PLL_160M);
  _i2s_ll_rx_set_mclk(hw, &mclk_div);
  i2s_ll_rx_set_bck_div_num(hw, bclk_div);
  i2s_ll_rx_update(hw);
#endif

  i2sinfo("I2S%d clk: rate=%" PRIu32 ", mclk=%" PRIu32
          ", bclk_div=%" PRIu32 "\n",
          priv->port, priv->rate, priv->mclk, bclk_div);
}

/****************************************************************************
 * Name: i2s_hw_init
 *
 * Description:
 *   Initialize the I2S and AHB-DMA hardware controllers.
 ****************************************************************************/

static void i2s_hw_init(FAR struct esp32p4_i2s_priv_s *priv)
{
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);
  int i;

  /* 1. Enable AHB-DMA bus clock and reset */

  HP_SYS_CLKRST.soc_clk_ctrl1.reg_ahb_pdma_sys_clk_en = 1;
  HP_SYS_CLKRST.hp_rst_en1.reg_rst_en_ahb_pdma = 0;
  ahb_dma_ll_force_enable_reg_clock(&AHB_DMA, true);
  ahb_dma_ll_set_default_memory_range(&AHB_DMA);

  /* 2. Enable I2S bus clock and reset */

  HP_SYS_CLKRST.soc_clk_ctrl2.reg_i2s0_apb_clk_en = 1;
  LP_AON_CLKRST.hp_clk_ctrl.hp_pad_i2s0_mclk_en = 1;
  HP_SYS_CLKRST.hp_rst_en2.reg_rst_en_i2s0_apb = 1;
  HP_SYS_CLKRST.hp_rst_en2.reg_rst_en_i2s0_apb = 0;

#ifdef CONFIG_ESP32P4_I2S0_TX
  HP_SYS_CLKRST.peri_clk_ctrl13.reg_i2s0_tx_clk_en = 1;
  _i2s_ll_mclk_bind_to_tx_clk(hw);
#elif defined(CONFIG_ESP32P4_I2S0_RX)
  /* MCLK has a single clock source selector.  When TX and RX are both
   * enabled, keep it bound to TX: RX is configured to share that clock.
   * Binding it to RX here would overwrite the TX selection and stall a
   * playback-only transfer.
   */

  _i2s_ll_mclk_bind_to_rx_clk(hw);
#endif

#ifdef CONFIG_ESP32P4_I2S0_RX
  HP_SYS_CLKRST.peri_clk_ctrl11.reg_i2s0_rx_clk_en = 1;
#endif

  /* 3. Configure GPIOs via Matrix MUX */

#if defined(CONFIG_ESP32P4_I2S0_MCLKPIN) && (CONFIG_ESP32P4_I2S0_MCLKPIN >= 0)
  esp_configgpio(CONFIG_ESP32P4_I2S0_MCLKPIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_MCLKPIN,
                      I2S0_MCLK_PAD_OUT_IDX, false, false);
#endif

#ifdef CONFIG_ESP32P4_I2S0_BCLKPIN
  esp_configgpio(CONFIG_ESP32P4_I2S0_BCLKPIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_BCLKPIN,
                      I2S0_O_BCK_PAD_OUT_IDX, false, false);
#endif

#ifdef CONFIG_ESP32P4_I2S0_WSPIN
  esp_configgpio(CONFIG_ESP32P4_I2S0_WSPIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_WSPIN,
                      I2S0_O_WS_PAD_OUT_IDX, false, false);
#endif

#ifdef CONFIG_ESP32P4_I2S0_DOUTPIN
  esp_configgpio(CONFIG_ESP32P4_I2S0_DOUTPIN, OUTPUT);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_DOUTPIN,
                      I2S0_O_SD_PAD_OUT_IDX, false, false);
#endif

#ifdef CONFIG_ESP32P4_I2S0_DINPIN
  esp_configgpio(CONFIG_ESP32P4_I2S0_DINPIN, INPUT | PULLUP);
  esp_gpio_matrix_in(CONFIG_ESP32P4_I2S0_DINPIN,
                     I2S0_I_SD_PAD_IN_IDX, false);
#endif

  /* 4. Configure I2S TX & RX Slot, Standard Philips format */

#ifdef CONFIG_ESP32P4_I2S0_TX
  i2s_ll_tx_reset(hw);
  i2s_ll_tx_reset_fifo(hw);
  i2s_ll_tx_enable_std(hw);
  i2s_ll_tx_set_slave_mod(hw, false);
  i2s_ll_tx_enable_msb_shift(hw, true);
  i2s_ll_tx_set_ws_width(hw, 32);
  i2s_ll_tx_set_sample_bit(hw, 32, priv->data_width);
  i2s_ll_tx_set_half_sample_bit(hw, 32);
  i2s_ll_tx_set_chan_num(hw, 2);
  i2s_ll_tx_set_active_chan_mask(hw, 0x03);

  /* AHB-DMA TX Channel setup */

  ahb_dma_ll_tx_connect_to_periph(&AHB_DMA, priv->dma_channel,
                                  SOC_GDMA_TRIG_PERIPH_I2S0);
  ahb_dma_ll_tx_set_priority(&AHB_DMA, priv->dma_channel, 1);
  ahb_dma_ll_tx_enable_data_burst(&AHB_DMA, priv->dma_channel, true);
  ahb_dma_ll_tx_enable_descriptor_burst(&AHB_DMA, priv->dma_channel, true);
  ahb_dma_ll_tx_reset_channel(&AHB_DMA, priv->dma_channel);
#endif

#ifdef CONFIG_ESP32P4_I2S0_RX
  i2s_ll_rx_reset(hw);
  i2s_ll_rx_reset_fifo(hw);
  i2s_ll_rx_enable_std(hw);
  i2s_ll_rx_set_slave_mod(hw, true); /* RX slave shares TX clock */
  i2s_ll_rx_enable_msb_shift(hw, true);
  i2s_ll_rx_set_ws_width(hw, 32);
  i2s_ll_rx_set_sample_bit(hw, 32, priv->data_width);
  i2s_ll_rx_set_half_sample_bit(hw, 32);
  i2s_ll_rx_set_chan_num(hw, 2);
  i2s_ll_rx_set_active_chan_mask(hw, 0x03);

  /* AHB-DMA RX Channel setup */

