uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
  ahb_dma_ll_rx_connect_to_periph(&AHB_DMA, priv->dma_channel,
                                  SOC_GDMA_TRIG_PERIPH_I2S0);
  ahb_dma_ll_rx_set_priority(&AHB_DMA, priv->dma_channel, 1);
  ahb_dma_ll_rx_enable_data_burst(&AHB_DMA, priv->dma_channel, true);
  ahb_dma_ll_rx_enable_descriptor_burst(&AHB_DMA, priv->dma_channel, true);
  ahb_dma_ll_rx_reset_channel(&AHB_DMA, priv->dma_channel);
#endif

  /* 5. Initialize buffer queues */

  sq_init(&priv->tx.pend);
  sq_init(&priv->tx.act);
  sq_init(&priv->tx.done);
  sq_init(&priv->tx_free);

  sq_init(&priv->rx.pend);
  sq_init(&priv->rx.act);
  sq_init(&priv->rx.done);
  sq_init(&priv->rx_free);

  for (i = 0; i < CONFIG_ESP32P4_I2S_MAXINFLIGHT; i++)
    {
      sq_addlast((FAR sq_entry_t *)&priv->tx_bufs[i], &priv->tx_free);
      sq_addlast((FAR sq_entry_t *)&priv->rx_bufs[i], &priv->rx_free);
    }

  /* 6. Configure clock rates */

  i2s_set_clock(priv);

  /* 7. Setup DMA Interrupts */

#ifdef CONFIG_ESP32P4_I2S0_TX
  priv->tx.cpuint = esp_setup_irq(ETS_AHB_PDMA_OUT_CH0_INTR_SOURCE, 1,
                                  ESP_IRQ_TRIGGER_LEVEL,
                                  i2s_tx_interrupt, priv);
  DEBUGASSERT(priv->tx.cpuint >= 0);
  up_enable_irq(ESP_SOURCE2IRQ(ETS_AHB_PDMA_OUT_CH0_INTR_SOURCE));
  ahb_dma_ll_tx_enable_interrupt(&AHB_DMA, priv->dma_channel,
                                 AHB_DMA_OUT_TOTAL_EOF_CH0_INT_ENA, true);
#endif

#ifdef CONFIG_ESP32P4_I2S0_RX
  priv->rx.cpuint = esp_setup_irq(ETS_AHB_PDMA_IN_CH0_INTR_SOURCE, 1,
                                  ESP_IRQ_TRIGGER_LEVEL,
                                  i2s_rx_interrupt, priv);
  DEBUGASSERT(priv->rx.cpuint >= 0);
  up_enable_irq(ESP_SOURCE2IRQ(ETS_AHB_PDMA_IN_CH0_INTR_SOURCE));
  ahb_dma_ll_rx_enable_interrupt(&AHB_DMA, priv->dma_channel,
                                 AHB_DMA_IN_DONE_CH0_INT_ENA, true);
#endif
}

#ifdef CONFIG_ESP32P4_I2S0_TX

/****************************************************************************
 * Name: i2s_tx_worker
 ****************************************************************************/

static void i2s_tx_worker(FAR void *arg)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)arg;
  FAR struct esp32p4_i2s_buf_s *buf;
  FAR struct ap_buffer_s *apb;
  i2s_callback_t callback;
  FAR void *cbarg;
  int result;
  irqstate_t flags;

  for (; ; )
    {
      flags = spin_lock_irqsave(&priv->slock);
      buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->tx.done);
      spin_unlock_irqrestore(&priv->slock, flags);

      if (buf == NULL)
        {
          break;
        }

      callback = buf->callback;
      apb      = buf->apb;
      cbarg    = buf->arg;
      result   = buf->result;

      flags = spin_lock_irqsave(&priv->slock);
      sq_addlast((FAR sq_entry_t *)buf, &priv->tx_free);
      spin_unlock_irqrestore(&priv->slock, flags);

      if (callback != NULL)
        {
          callback(&priv->dev, apb, cbarg, result);
        }
    }
}

/****************************************************************************
 * Name: i2s_tx_interrupt
 ****************************************************************************/

static int i2s_tx_interrupt(int irq, FAR void *context, FAR void *arg)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)arg;
  uint32_t st = ahb_dma_ll_tx_get_interrupt_status(&AHB_DMA,
                                                  priv->dma_channel, false);
  FAR struct esp32p4_i2s_buf_s *buf;
  FAR struct esp32p4_i2s_buf_s *next;
  irqstate_t flags;
  bool schedule = false;

  ahb_dma_ll_tx_clear_interrupt_status(&AHB_DMA, priv->dma_channel, st);
  flags = spin_lock_irqsave(&priv->slock);

  if ((st & AHB_DMA_OUT_TOTAL_EOF_CH0_INT_ST) != 0)
    {
      buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->tx.act);
      if (buf != NULL)
        {
          buf->result = OK;
          sq_addlast((FAR sq_entry_t *)buf, &priv->tx.done);
        }

      next = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->tx.pend);
      if (next != NULL)
        {
          sq_addlast((FAR sq_entry_t *)next, &priv->tx.act);
          ahb_dma_ll_tx_reset_channel(&AHB_DMA, priv->dma_channel);
          ahb_dma_ll_tx_set_desc_addr(&AHB_DMA, priv->dma_channel,
                                      (uint32_t)&next->dma_desc);
          ahb_dma_ll_tx_start(&AHB_DMA, priv->dma_channel);
          i2s_ll_tx_start(I2S_LL_GET_HW(priv->port));
        }
      else
        {
          priv->tx.running = false;
        }

      schedule = true;
    }

  spin_unlock_irqrestore(&priv->slock, flags);
  if (schedule)
    {
      work_queue(HPWORK, &priv->tx.work, i2s_tx_worker, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_txchannels
 ****************************************************************************/

static int i2s_txchannels(FAR struct i2s_dev_s *dev, uint8_t channels)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  if (channels != 1 && channels != 2)
    {
      return -EINVAL;
    }

  priv->channels = channels;
  i2s_set_clock(priv);
  return OK;
}

/****************************************************************************
 * Name: i2s_txsamplerate
 ****************************************************************************/

static uint32_t i2s_txsamplerate(FAR struct i2s_dev_s *dev, uint32_t rate)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  priv->rate = rate;
  priv->mclk = rate * 256;
  i2s_set_clock(priv);
  return priv->rate;
}

/****************************************************************************
 * Name: i2s_txdatawidth
 ****************************************************************************/

static uint32_t i2s_txdatawidth(FAR struct i2s_dev_s *dev, int bits)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);

