uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
  if (bits != 16 && bits != 24 && bits != 32)
    {
      return -EINVAL;
    }

  priv->data_width = bits;
  i2s_ll_tx_set_sample_bit(hw, 32, priv->data_width);
  i2s_ll_tx_update(hw);
  return priv->data_width;
}

/****************************************************************************
 * Name: i2s_send
 ****************************************************************************/

static int i2s_send(FAR struct i2s_dev_s *dev,
                    FAR struct ap_buffer_s *apb,
                    i2s_callback_t callback, FAR void *arg,
                    uint32_t timeout)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);
  FAR struct esp32p4_i2s_buf_s *buf;
  irqstate_t flags;

  if (apb == NULL || apb->nbytes == 0 ||
      apb->nbytes > apb->nmaxbytes || apb->curbyte >= apb->nbytes ||
      apb->nbytes - apb->curbyte > I2S_DMA_MAX_BYTES)
    {
      return -EINVAL;
    }

  /* TX and RX share the board's physical BCLK/WS pins.  Select the TX
   * clock generator whenever playback becomes active.
   */

  _i2s_ll_mclk_bind_to_tx_clk(hw);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_BCLKPIN,
                      I2S0_O_BCK_PAD_OUT_IDX, false, false);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_WSPIN,
                      I2S0_O_WS_PAD_OUT_IDX, false, false);
  i2s_ll_tx_set_slave_mod(hw, false);
  i2s_ll_tx_update(hw);

  flags = spin_lock_irqsave(&priv->slock);
  buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->tx_free);
  if (buf == NULL)
    {
      spin_unlock_irqrestore(&priv->slock, flags);
      return -ENOMEM;
    }

  buf->apb = apb;
  buf->callback = callback;
  buf->arg = arg;
  buf->result = OK;

  buf->dma_desc.dw0.size = I2S_ALIGN_UP(apb->nbytes - apb->curbyte, 4);
  buf->dma_desc.dw0.length = apb->nbytes - apb->curbyte;
  buf->dma_desc.dw0.owner = 1;
  buf->dma_desc.dw0.suc_eof = 1;
  buf->dma_desc.buffer = &apb->samp[apb->curbyte];
  buf->dma_desc.next = NULL;

  /* ESP32-P4 data RAM is cached but AHB DMA is not cache coherent.  Clean
   * both the samples and descriptor after filling them and before exposing
   * the descriptor to DMA.  Without this, DMA may observe a stale owner bit
   * or stale sample data and never produce TOTAL_EOF.
   */

  esp_cache_msync(buf->dma_desc.buffer, buf->dma_desc.dw0.length,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  esp_cache_msync(&buf->dma_desc, sizeof(buf->dma_desc),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  if (!priv->tx.running)
    {
      priv->tx.running = true;
      sq_addlast((FAR sq_entry_t *)buf, &priv->tx.act);
      ahb_dma_ll_tx_reset_channel(&AHB_DMA, priv->dma_channel);
      ahb_dma_ll_tx_set_desc_addr(&AHB_DMA, priv->dma_channel,
                                  (uint32_t)&buf->dma_desc);
      ahb_dma_ll_tx_start(&AHB_DMA, priv->dma_channel);
      i2s_ll_tx_start(I2S_LL_GET_HW(priv->port));
    }
  else
    {
      sq_addlast((FAR sq_entry_t *)buf, &priv->tx.pend);
    }

  spin_unlock_irqrestore(&priv->slock, flags);

  return OK;
}

#endif /* CONFIG_ESP32P4_I2S0_TX */

#ifdef CONFIG_ESP32P4_I2S0_RX

/****************************************************************************
 * Name: i2s_rx_worker
 ****************************************************************************/

static void i2s_rx_worker(FAR void *arg)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)arg;
  FAR struct esp32p4_i2s_buf_s *buf;
  FAR struct ap_buffer_s *apb;
  i2s_callback_t callback;
  FAR void *cbarg;
  int result;
  irqstate_t flags;

  for (; ; )
    {
      flags = spin_lock_irqsave(&priv->slock);
      buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->rx.done);
      spin_unlock_irqrestore(&priv->slock, flags);

      if (buf == NULL)
        {
          break;
        }

      callback = buf->callback;
      apb      = buf->apb;
      cbarg    = buf->arg;
      result   = buf->result;

      if (callback != NULL)
        {
          /* Descriptor and DMA storage occupy private cache lines.  Never
           * invalidate an unaligned APB and discard adjacent CPU metadata.
           * RX length is written by DMA, not inferred from capacity.
           */
          int sync = esp_cache_msync(&buf->dma_desc, I2S_DMA_CACHE_ALIGN,
                                    ESP_CACHE_MSYNC_FLAG_DIR_M2C);
          unsigned int length = buf->dma_desc.dw0.length;
          apb->nbytes = 0;
          if ((sync != ESP_OK && sync != ESP_ERR_NOT_SUPPORTED) ||
              buf->dma_desc.dw0.owner != 0 || length == 0 ||
              length > apb->nmaxbytes || (length % 4) != 0 ||
              buf->dma_desc.dw0.err_eof)
            {
              i2serr("RX invalid completion: sync=%d owner=%u length=%u capacity=%u\n",
                     sync, buf->dma_desc.dw0.owner, length, apb->nmaxbytes);
              result = -EIO;
            }
          else
            {
              sync = esp_cache_msync(buf->dma_desc.buffer,
                                    I2S_ALIGN_UP(length, I2S_DMA_CACHE_ALIGN),
                                    ESP_CACHE_MSYNC_FLAG_DIR_M2C);
              if (sync != ESP_OK && sync != ESP_ERR_NOT_SUPPORTED)
                result = -EIO;
              else if (result == OK)
                {
                  memcpy(apb->samp, buf->dma_desc.buffer, length);
                  apb->nbytes = length;
                }
            }
        }

      flags = spin_lock_irqsave(&priv->slock);
      sq_addlast((FAR sq_entry_t *)buf, &priv->rx_free);
      spin_unlock_irqrestore(&priv->slock, flags);

      if (callback != NULL)
        {
          callback(&priv->dev, apb, cbarg, result);
        }
    }
}

/****************************************************************************
 * Name: i2s_rx_interrupt
 ****************************************************************************/

static int i2s_rx_interrupt(int irq, FAR void *context, FAR void *arg)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)arg;
  uint32_t st = ahb_dma_ll_rx_get_interrupt_status(&AHB_DMA,
                                                  priv->dma_channel, false);
  FAR struct esp32p4_i2s_buf_s *buf;
  FAR struct esp32p4_i2s_buf_s *next;
  irqstate_t flags;
  bool schedule = false;

  ahb_dma_ll_rx_clear_interrupt_status(&AHB_DMA, priv->dma_channel, st);
  flags = spin_lock_irqsave(&priv->slock);

