uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
  if ((st & AHB_DMA_IN_DONE_CH0_INT_ST) != 0)
    {
      buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->rx.act);
      if (buf != NULL)
        {
          buf->apb->nbytes = 0;
          buf->result = OK;
          sq_addlast((FAR sq_entry_t *)buf, &priv->rx.done);
        }

      next = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->rx.pend);
      if (next != NULL)
        {
          sq_addlast((FAR sq_entry_t *)next, &priv->rx.act);
          i2s_ll_rx_set_eof_num(I2S_LL_GET_HW(priv->port),
                                next->apb->nmaxbytes);
          ahb_dma_ll_rx_reset_channel(&AHB_DMA, priv->dma_channel);
          ahb_dma_ll_rx_set_desc_addr(&AHB_DMA, priv->dma_channel,
                                      (uint32_t)&next->dma_desc);
          ahb_dma_ll_rx_start(&AHB_DMA, priv->dma_channel);
          i2s_ll_rx_start(I2S_LL_GET_HW(priv->port));
        }
      else
        {
          priv->rx.running = false;
        }

      schedule = true;
    }

  spin_unlock_irqrestore(&priv->slock, flags);
  if (schedule)
    {
      work_queue(HPWORK, &priv->rx.work, i2s_rx_worker, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: i2s_rxchannels
 ****************************************************************************/

static int i2s_rxchannels(FAR struct i2s_dev_s *dev, uint8_t channels)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  if (channels != 1 && channels != 2)
    {
      return -EINVAL;
    }

  priv->channels = channels;
  i2s_set_clock(priv);
  return OK;
}

/****************************************************************************
 * Name: i2s_rxsamplerate
 ****************************************************************************/

static uint32_t i2s_rxsamplerate(FAR struct i2s_dev_s *dev, uint32_t rate)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  priv->rate = rate;
  priv->mclk = rate * 256;
  i2s_set_clock(priv);
  return priv->rate;
}

/****************************************************************************
 * Name: i2s_rxdatawidth
 ****************************************************************************/

static uint32_t i2s_rxdatawidth(FAR struct i2s_dev_s *dev, int bits)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);

  if (bits != 16 && bits != 24 && bits != 32)
    {
      return -EINVAL;
    }

  priv->data_width = bits;
  i2s_ll_rx_set_sample_bit(hw, 32, priv->data_width);
  i2s_ll_rx_update(hw);
  return priv->data_width;
}

/****************************************************************************
 * Name: i2s_receive
 ****************************************************************************/

static int i2s_receive(FAR struct i2s_dev_s *dev,
                       FAR struct ap_buffer_s *apb,
                       i2s_callback_t callback, FAR void *arg,
                       uint32_t timeout)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  i2s_dev_t *hw = I2S_LL_GET_HW(priv->port);
  FAR struct esp32p4_i2s_buf_s *buf;
  irqstate_t flags;

  if (apb == NULL || apb->nmaxbytes == 0 ||
      apb->nmaxbytes > I2S_DMA_MAX_BYTES || (apb->nmaxbytes % 4) != 0)
    {
      return -EINVAL;
    }

  /* A capture-only stream cannot borrow BCLK/WS from an inactive TX path.
   * Make RX the master and route its clock outputs onto the shared pins.
   */

  _i2s_ll_mclk_bind_to_rx_clk(hw);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_BCLKPIN,
                      I2S0_I_BCK_PAD_OUT_IDX, false, false);
  esp_gpio_matrix_out(CONFIG_ESP32P4_I2S0_WSPIN,
                      I2S0_I_WS_PAD_OUT_IDX, false, false);
  i2s_ll_rx_set_slave_mod(hw, false);
  i2s_ll_rx_update(hw);

  flags = spin_lock_irqsave(&priv->slock);
  buf = (FAR struct esp32p4_i2s_buf_s *)sq_remfirst(&priv->rx_free);
  if (buf == NULL)
    {
      spin_unlock_irqrestore(&priv->slock, flags);
      return -ENOMEM;
    }

  buf->apb = apb;
  buf->callback = callback;
  buf->arg = arg;
  buf->result = OK;

  memset(&buf->dma_desc, 0, sizeof(buf->dma_desc));
  buf->dma_desc.dw0.size = apb->nmaxbytes;
  buf->dma_desc.dw0.length = 0;
  buf->dma_desc.dw0.owner = 1;
  buf->dma_desc.dw0.suc_eof = 0;
  buf->dma_desc.buffer = priv->rx_data[buf - priv->rx_bufs];
  buf->dma_desc.next = NULL;

  int sync = esp_cache_msync(buf->dma_desc.buffer,
                  I2S_ALIGN_UP(apb->nmaxbytes, I2S_DMA_CACHE_ALIGN),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_INVALIDATE);
  if (sync == ESP_OK || sync == ESP_ERR_NOT_SUPPORTED)
    sync = esp_cache_msync(&buf->dma_desc, I2S_DMA_CACHE_ALIGN,
                          ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  if (sync != ESP_OK && sync != ESP_ERR_NOT_SUPPORTED)
    {
      sq_addlast((FAR sq_entry_t *)buf, &priv->rx_free);
      spin_unlock_irqrestore(&priv->slock, flags);
      return -EIO;
    }

  if (!priv->rx.running)
    {
      priv->rx.running = true;
      sq_addlast((FAR sq_entry_t *)buf, &priv->rx.act);
      i2s_ll_rx_set_eof_num(I2S_LL_GET_HW(priv->port), apb->nmaxbytes);
      i2s_ll_rx_update(I2S_LL_GET_HW(priv->port));
      ahb_dma_ll_rx_reset_channel(&AHB_DMA, priv->dma_channel);
      ahb_dma_ll_rx_set_desc_addr(&AHB_DMA, priv->dma_channel,
                                  (uint32_t)&buf->dma_desc);
      ahb_dma_ll_rx_start(&AHB_DMA, priv->dma_channel);
      i2s_ll_rx_start(I2S_LL_GET_HW(priv->port));
    }
  else
    {
      sq_addlast((FAR sq_entry_t *)buf, &priv->rx.pend);
    }

  spin_unlock_irqrestore(&priv->slock, flags);

  return OK;
}

#endif /* CONFIG_ESP32P4_I2S0_RX */

/****************************************************************************
 * Name: i2s_ioctl
 ****************************************************************************/

static int i2s_ioctl(FAR struct i2s_dev_s *dev, int cmd, unsigned long arg)
{
  FAR struct audio_buf_desc_s *bufdesc;

