uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_i2s.c
  switch (cmd)
    {
      case AUDIOIOC_ALLOCBUFFER:
        bufdesc = (FAR struct audio_buf_desc_s *)(uintptr_t)arg;
        if (bufdesc == NULL || bufdesc->u.pbuffer == NULL ||
            bufdesc->numbytes == 0)
          {
            return -EINVAL;
          }

        return apb_alloc(bufdesc);

      case AUDIOIOC_FREEBUFFER:
        bufdesc = (FAR struct audio_buf_desc_s *)(uintptr_t)arg;
        if (bufdesc == NULL || bufdesc->u.buffer == NULL)
          {
            return -EINVAL;
          }

        apb_free(bufdesc->u.buffer);
        return sizeof(struct audio_buf_desc_s);

      default:
        return -ENOTTY;
    }
}

/****************************************************************************
 * Name: i2s_getmclkfrequency
 ****************************************************************************/

static uint32_t i2s_getmclkfrequency(FAR struct i2s_dev_s *dev)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  return priv->mclk;
}

/****************************************************************************
 * Name: i2s_setmclkfrequency
 ****************************************************************************/

static uint32_t i2s_setmclkfrequency(FAR struct i2s_dev_s *dev,
                                     uint32_t frequency)
{
  FAR struct esp32p4_i2s_priv_s *priv = (FAR struct esp32p4_i2s_priv_s *)dev;
  priv->mclk = frequency;
  i2s_set_clock(priv);
  return priv->mclk;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_i2sbus_initialize
 ****************************************************************************/

FAR struct i2s_dev_s *esp32p4_i2sbus_initialize(int port)
{
  FAR struct esp32p4_i2s_priv_s *priv;

  if (port == 0)
    {
      priv = &g_i2s0_priv;
    }
  else
    {
      return NULL;
    }

  nxmutex_lock(&priv->lock);
  i2s_hw_init(priv);
  nxmutex_unlock(&priv->lock);

  return &priv->dev;
}
